torbrodtkorb/alva-master/firmware/pack/edc/AVR64DA28.PIC
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x213">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x8" edc:desc="Channel 3 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI_SYNCH" edc:desc="UPDI SYNCH character" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV512" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV256" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV128" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV64" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="AC1_OUT" edc:desc="Analog Comparator 1 out" edc:when="(field &amp; 0xFF) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="AC2_OUT" edc:desc="Analog Comparator 2 out" edc:when="(field &amp; 0xFF) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RESRDY" edc:desc="ADC 0 Result Ready" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="PTC_RESRDY" edc:desc="PTC Result Ready" edc:when="(field &amp; 0xFF) == 0x28"/>
                <edc:SFRFieldSemantic edc:cname="ZCD0" edc:desc="Zero Cross Detect 0 out" edc:when="(field &amp; 0xFF) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN0" edc:desc="Port C Pin 0" edc:when="(field &amp; 0xFF) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN1" edc:desc="Port C Pin 1" edc:when="(field &amp; 0xFF) == 0x41"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN2" edc:desc="Port C Pin 2" edc:when="(field &amp; 0xFF) == 0x42"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN3" edc:desc="Port C Pin 3" edc:when="(field &amp; 0xFF) == 0x43"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN0" edc:desc="Port D Pin 0" edc:when="(field &amp; 0xFF) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN1" edc:desc="Port D Pin 1" edc:when="(field &amp; 0xFF) == 0x49"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN2" edc:desc="Port D Pin 2" edc:when="(field &amp; 0xFF) == 0x4A"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN3" edc:desc="Port D Pin 3" edc:when="(field &amp; 0xFF) == 0x4B"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN4" edc:desc="Port D Pin 4" edc:when="(field &amp; 0xFF) == 0x4C"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN5" edc:desc="Port D Pin 5" edc:when="(field &amp; 0xFF) == 0x4D"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN6" edc:desc="Port D Pin 6" edc:when="(field &amp; 0xFF) == 0x4E"/>
                <edc:SFRFieldSemantic edc:cname="PORTD_PIN7" edc:desc="Port D Pin 7" edc:when="(field &amp; 0xFF) == 0x4F"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="USART2_XCK" edc:desc="USART 2 XCK" edc:when="(field &amp; 0xFF) == 0x62"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 SCK" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="SPI1_SCK" edc:desc="SPI 1 SCK" edc:when="(field &amp; 0xFF) == 0x69"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_CAPT" edc:desc="Timer/Counter B2 capture" edc:when="(field &amp; 0xFF) == 0xA4"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_OVF" edc:desc="Timer/Counter B2 overflow" edc:when="(field &amp; 0xFF) == 0xA5"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBCLR" edc:desc="Timer/Counter D0 event 0" edc:when="(field &amp; 0xFF) == 0xB0"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPASET" edc:desc="Timer/Counter D0 event 1" edc:when="(field &amp; 0xFF) == 0xB1"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBSET" edc:desc="Timer/Counter D0 event 2" edc:when="(field &amp; 0xFF) == 0xB2"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_PROGEV" edc:desc="Timer/Counter D0 event 3" edc:when="(field &amp; 0xFF) == 0xB3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x214">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x8" edc:desc="Channel 4 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI_SYNCH" edc:desc="UPDI SYNCH character" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV8192" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV4096" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV2048" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV1024" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="AC1_OUT" edc:desc="Analog Comparator 1 out" edc:when="(field &amp; 0xFF) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="AC2_OUT" edc:desc="Analog Comparator 2 out" edc:when="(field &amp; 0xFF) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RESRDY" edc:desc="ADC 0 Result Ready" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="PTC_RESRDY" edc:desc="PTC Result Ready" edc:when="(field &amp; 0xFF) == 0x28"/>
                <edc:SFRFieldSemantic edc:cname="ZCD0" edc:desc="Zero Cross Detect 0 out" edc:when="(field &amp; 0xFF) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="PORTF_PIN0" edc:desc="Port F Pin 0" edc:when="(field &amp; 0xFF) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="PORTF_PIN1" edc:desc="Port F Pin 1" edc:when="(field &amp; 0xFF) == 0x49"/>
                <edc:SFRFieldSemantic edc:cname="PORTF_PIN6" edc:desc="Port F Pin 6" edc:when="(field &amp; 0xFF) == 0x4E"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="USART2_XCK" edc:desc="USART 2 XCK" edc:when="(field &amp; 0xFF) == 0x62"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 SCK" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="SPI1_SCK" edc:desc="SPI 1 SCK" edc:when="(field &amp; 0xFF) == 0x69"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte timer underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte timer underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_CAPT" edc:desc="Timer/Counter B2 capture" edc:when="(field &amp; 0xFF) == 0xA4"/>
                <edc:SFRFieldSemantic edc:cname="TCB2_OVF" edc:desc="Timer/Counter B2 overflow" edc:when="(field &amp; 0xFF) == 0xA5"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBCLR" edc:desc="Timer/Counter D0 event 0" edc:when="(field &amp; 0xFF) == 0xB0"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPASET" edc:desc="Timer/Counter D0 event 1" edc:when="(field &amp; 0xFF) == 0xB1"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_CMPBSET" edc:desc="Timer/Counter D0 event 2" edc:when="(field &amp; 0xFF) == 0xB2"/>
                <edc:SFRFieldSemantic edc:cname="TCD0_PROGEV" edc:desc="Timer/Counter D0 event 3" edc:when="(field &amp; 0xFF) == 0xB3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
