torbrodtkorb/alva-master/firmware/pack/edc/AVR64DA28.PIC
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x68B"/>
        <edc:SFRDef ltx:memberofperipheral="AC1" edc:cname="DAC1REF" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="11111111" edc:mclr="11111111" edc:_addr="0x68D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC1">
              <edc:SFRFieldDef edc:cname="DACREF" edc:nzwidth="0x8" edc:desc="DACREF"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC1" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="--nn---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x31" edc:_addr="0x68E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC1">
              <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INTMODE" edc:nzwidth="0x2" edc:desc="Interrupt Mode">
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Window interrupt when input above both references" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Window interrupt when input betweeen references" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Window interrupt when input below both references" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="OUTSIDE" edc:desc="Window interrupt when input outside reference" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC1" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nn-n---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD1" edc:_addr="0x68F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC1">
              <edc:SFRFieldDef edc:cname="CMPIF" edc:nzwidth="0x1" edc:desc="Analog Comparator Interrupt Flag"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CMPSTATE" edc:nzwidth="0x1" edc:desc="Analog Comparator State"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="WINSTATE" edc:nzwidth="0x2" edc:desc="Analog Comparator Window State">
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Above window" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Inside window" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Below window" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nn-nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xDF" edc:_addr="0x690">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
              <edc:SFRFieldDef edc:cname="HYSMODE" edc:nzwidth="0x2" edc:desc="Hysteresis Mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No hysteresis" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SMALL" edc:desc="Small hysteresis" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Medium hysteresis" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="LARGE" edc:desc="Large hysteresis" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="POWER" edc:nzwidth="0x2" edc:desc="Power profile">
                <edc:SFRFieldSemantic edc:cname="PROFILE0" edc:desc="Power profile 0, Shortest response time, highest consumption" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PROFILE1" edc:desc="Power profile 1" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="PROFILE2" edc:desc="Power profile 2" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:nzwidth="0x1" edc:desc="Output Pad Enable"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby Mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x691">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="WINSEL" edc:nzwidth="0x2" edc:desc="Window selection mode">
                <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Window function disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPSEL1" edc:desc="Select ACn+1 as upper limit in window compare" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="UPSEL2" edc:desc="Select ACn+2 as upper limit in window compare" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="MUXCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x692">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x3" edc:desc="Negative Input MUX Selection">
                <edc:SFRFieldSemantic edc:cname="AINN0" edc:desc="Negative Pin 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="AINN1" edc:desc="Negative Pin 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AINN2" edc:desc="Negative Pin 2" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DACREF" edc:desc="DAC Reference" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x3" edc:desc="Positive Input MUX Selection">
                <edc:SFRFieldSemantic edc:cname="AINP0" edc:desc="Positive Pin 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="AINP1" edc:desc="Positive Pin 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AINP2" edc:desc="Positive Pin 2" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="AINP3" edc:desc="Positive Pin 3" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INITVAL" edc:nzwidth="0x1" edc:desc="AC Output Initial Value">
                <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Output initialized to 0" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Output initialized to 1" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INVERT" edc:nzwidth="0x1" edc:desc="Invert AC Output"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x693"/>
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="DAC2REF" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="11111111" edc:mclr="11111111" edc:_addr="0x695">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="DACREF" edc:nzwidth="0x8" edc:desc="DACREF"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="--nn---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x31" edc:_addr="0x696">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INTMODE" edc:nzwidth="0x2" edc:desc="Interrupt Mode">
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Window interrupt when input above both references" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Window interrupt when input betweeen references" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Window interrupt when input below both references" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="OUTSIDE" edc:desc="Window interrupt when input outside reference" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
